{
  "name": "Beginner Web Programming Project",
  "order": 6,
  "time": "2 hours",
  "helpRoom": "Help",
  "challenges": [
    {
      "id": "587d78af367417b2b2512b02",
      "title": "Get Set for our Beginner Web Programming Project",
      "description": [
        [
          "//dl.dropboxusercontent.com/s/ezohxjdrrvpmm8x/tcc-tribute-page-codepen.png?dl=0",
          "An image of a Tribute Page, our first front end project.",
          "Our Beginner development project will give you a chance to apply the skills you've developed up to this point. We'll use a popular browser-based code editor called CodePen.",
          ""
        ],
        [
          "//i.imgur.com/WBetuBa.jpg",
          "A programmer punching through his laptop screen in frustration.",
          "This project is harder than what you have done before. You might get frustrated. But don't quit. This gets easier with practice.",
          ""
        ],
        [
          "//i.imgur.com/p2TpOQd.jpg",
          "A cute dog jumping over a hurdle and winking and pointing his paw at you.",
          "When you get stuck, just use the Read-Search-Ask methodology. Don't worry - you've got this.",
          ""
        ],
        [
          "//i.imgur.com/G1saeDt.gif",
          "A gif showing how to create a Codepen account.",
          "For this project, we'll use a popular browser-based code editor called CodePen. Click the \"Open link in new tab\" button below to open CodePen's signup page. Fill out the form and click \"Sign up\". <br><div class=\"small\">Note: If you already have a CodePen account, you can skip this step by clicking \"Open link in new tab\", closing the new tab that opens, then clicking \"go to my next step\".",
          "https://codepen.io/accounts/signup/user/free"
        ],
        [
          "//i.imgur.com/U4y9RJ1.gif",
          "A gif showing that you can type \"hello world\" will output \"hello world\" in the preview window. You can also drag windows to resize them, and change their orientation.",
          "In the HTML box, create an <code>h1</code> element with the text \"Hello World\". You can drag the frames around to resize them. You can also click the \"Change View\" button and change the orientation of the frames. Play around as much as you want to familiarize yourself with Codepen. If you get stuck, you can click your Codepen profile and then \"Help\" for Codepen documentation.",
          ""
        ],
        [
          "",
          "",
          "Now that you have an account, you can create as many Codepens as you want for your own websites. We are done with the \"Hello World\" Codepen so you can delete it, or leave it there for trying out HTML and doing experiments. In the next steps we will learn about another way to create new Codepens that you will need to use for your assigned projects.",
          ""
        ]      ],
      "challengeSeed": [],
      "tests": [],
      "type": "Waypoint",
      "isRequired": false,
      "challengeType": 7
    },
    {
      "id": "5a96f2396033eff2641401c4",
      "title": "Forking a CodePen to start a new project",
      "description": [
        [
          "//dl.dropboxusercontent.com/s/2mrt5t4px5i80vq/tcc-codepen-fork-me.png",
          "A picture showing how to fork a Codepen.",
          "Now you will learn how to fork a CodePen to start each new project. See the picture above.<br>\"Forking\" code is similar to copying it and that definition is good enough for now.<br>Click the \"Open link in new tab\" button below and it will open a Codepen. Fork that Codepen to start your next project. Come back here when you have pressed the \"Fork\" button.",
          "https://codepen.io/tchaffee/pen/XVRzMz"
        ],
        [
          "//dl.dropboxusercontent.com/s/1xzm4zl60h6ouqa/tcc-codepen-rename-fork.png",
          "A picture showing how to change the title of a Codepen.",
          "Remember to change the title of your Codepen after you fork it (see above). For example, if your project is about Ada Lovelace, then you should change the title to \"Ada Lovelace Tribute Page\"<br>Remember to save your work often!",
          ""
        ]      
      ],
      "challengeSeed": [],
      "tests": [],
      "type": "waypoint",
      "isRequired": false,
      "challengeType": 7
    },    
    {
      "id": "bd7158d8c442eddfaeb5bd18",
      "title": "Build a Tribute Page",
      "description": [
        "Choose something or someone that is important to you. Give it your own personal style using CSS.",
        "Here's a <a href='https://dl.dropboxusercontent.com/s/ezw62vubwq16w9y/tcc-tribute-page-example-image.png' target='_blank'>picture of an example Tribute Page </a> so you can see what a finished project looks like.",
        "Use the forked Codepen you created in the previous section to code your Tribute Page.",
        "In your forked Codepen, run the tests before you do any coding. Write code to get each test to pass, one at a time, and when all the tests pass you will have a finished Tribute Page.<br><br><img src=\"//dl.dropboxusercontent.com/s/65eci88yemyh755/tcc-codepen-run-tests.png\"/>",
        "When you're done, use the button below to submit the URL to your working project."
      ],
      "releasedOn": "January 1, 2016",
      "challengeSeed": [
"Nk0DzQi"
      ],
      "tests": [],
      "type": "zipline",
      "isRequired": true,
      "challengeType": 3
    }
  ]
}
